<template>
    <div class="wrap">
        <div class="content">
            <div class="qa">
                <div class="qaTitle">防疫旅館</div><span class="qaText">新冠病毒COVID-19
                    疫情從2020年1月開始於全球蔓延，在疫情擴散期間各國政府無不對疫情做出相對應的防疫政策及措施，其中，居家檢疫更是一大重要項目，規定入境返鄉民眾須入住防疫旅館或居家檢疫，確認期間無症狀或其傳染力已大幅降低至幾乎已無傳染力，藉此降低疫情擴散的風險。14天防疫假期響應政府防疫政策，整理台灣北部、中部、南部地區經濟實惠且安心合法的防疫旅館，一同加入防疫陣列，提供返鄉回國的民眾快速尋找安全合適防疫旅館的平台，擁有安心舒適的14天防疫生活。</span>
                <ul class="qaSubtitle">
                    <li class="qaSubtitleItem">
                        <div class="qaSubtitlePic"><img
                                alt=""
                                src="/assets/icon/qa01.png"
                            ></div><span class="qaSubtitleText">嚴謹遵守政府規定的標準<br>消毒程序及防護措施。</span>
                    </li>
                    <li class="qaSubtitleItem">
                        <div class="qaSubtitlePic"><img
                                alt=""
                                src="/assets/icon/qa02.png"
                            ></div><span class="qaSubtitleText">提供美味營養三餐，<br>天天健康有體力。</span>
                    </li>
                    <li class="qaSubtitleItem">
                        <div class="qaSubtitlePic"> <img
                                alt=""
                                src="/assets/icon/qa03.png"
                            ></div><span class="qaSubtitleText">24小時客服中心，<br>提供最即時的幫助。</span>
                    </li>
                </ul>
                <div class="qaTitle">防疫旅館FAQ</div>
                <template v-for="item in FAQArray">
                    <ul class="qaList">
                        <li class="qaListTitle"> <span>— {{ item.cityName }}防疫旅館 —</span></li>
                        <li class="qaListSubtitle"> <span>{{ item.note }}</span>
                        </li>
                        <li
                            v-for="(QA, index) in item.QaAs"
                            class="qaListItem"
                        >
                            <div class="qaListItemTitle">
                                <span class="qaListItemTitleNum">{{ index + 1 }} .</span>
                                <span class="qaListItemTitleContent">
                                    {{ QA.q }}
                                </span>
                            </div>
                            <div class="qaListItemText">
                                <span>{{ QA.a }}</span>
                            </div>
                        </li>

                    </ul>
                    <div class="qaLastInfoWrap">
                        <span class="qaLastInfoText">
                            歡迎加入我們的官方LNE@，有24小時客服協助您預定{{ item.cityName
                            }}防疫旅館，或者解答您的防疫旅館相關問題。
                        </span>
                        <div class="qaLastInfoBtnWrap">

                            <router-link
                                class="qaLastInfoBtn"
                                :to="item.link"
                            >
                                查看{{ item.cityName }}防疫旅館房型
                            </router-link>
                            <!-- <a
                                :href="item.link"
                                class="qaLastInfoBtn"
                            >
                                查看{{ item.cityName }}防疫旅館房型
                            </a> -->
                            <a
                                href="./contactus.html"
                                class="qaLastInfoBtn"
                            >
                                聯絡我們
                            </a>
                        </div>
                    </div>
                </template>
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
import { ref } from 'vue';

const FAQArray = ref([
    {
        cityName: "台北",
        note: '重點整理常見欲預定台北防疫旅館之民眾提出的相關問題，您可以透過下列問題快速對台北防疫旅館有基本的認識。',
        QaAs: [
            {
                q: '防疫旅館房間的消毒、環境衛生安全嗎 ?',
                a: '旅館於每次退房後會請專業消毒公司針對客房、走廊、大廳及電梯進行全面防疫消毒作業，全程遵守政府規範的消毒及防護措施，超高規格的清潔作業程序、紫外線燈管殺菌注重每一個小細節，提供您最安全舒適的防疫環境。',
            }, {
                q: '到達防疫旅館後，有防疫安全措施嗎？',
                a: '各防疫旅館皆有規劃專屬防疫動線，接待人員全程配戴口罩、自主管理量體溫，下車行經專屬安全通道直達房間，安全不擔心！',
            }, {
                q: '可以叫外送嗎？',
                a: '可以的！請於外送平台訂餐並付清費用後，在訂單上備註房號，一律送至防疫旅館大廳櫃檯，由櫃檯人員於三餐配送時間送至住客房門外。',
            }, {
                q: '有需求如何聯絡服務人員呢？',
                a: '各防疫旅館皆有24H客服中心，可使用房內電話或官方LINE@帳號直接進行聯繫，需要我們的時候隨時都在。',
            }, {
                q: '退房後防疫旅館會提供什麼資料或文件，給住客申請相關補助？',
                a: '退房後請至旅館櫃檯辦理退房，專人會提供防疫旅館入住證明及發票，以便旅客順利申請政府補助。退房後防疫旅館會提供什麼資料或文件，給住客申請相關補助？',
            },
        ],
        link: '/home#taipei'
    }, {
        cityName: "台中",
        note: '預定台中防疫旅館之前，您可以透過以下 Q&A 對台中防疫旅館有初步快速的認識。',
        QaAs: [
            {
                q: '房間是如何消毒的，有確實安全嗎？',
                a: '每次住客退房後，旅館都會請專業的消毒公司，針對大廳、走廊、客房及電梯等進行全面性消毒作業，依照政府的規定進行消毒後，還會使用紫外線燈管殺菌，請安心入住。',
            }, {
                q: '抵達旅館之後，會有相關的安全維護嗎？',
                a: '旅館會從入口處開始，規劃專屬的防疫動線，現場的接待人員全程配戴口罩及自主量測體溫，由入口到房間的專屬安全通道，讓你安全無顧慮！',
            }, {
                q: '每天提供的三餐菜色內容是什麼？',
                a: '每天的菜色會由當地的老饕精心挑選，不同菜系各種美食、只有在地人才知道的美味小吃，滿足您對美食的超高標準。',
            }, {
                q: '餐點若有特殊需求怎麼辦？',
                a: '如果有素食、食物過敏或宗教問題，可於訂房時告知客服人員，我們會為您準備合適的餐食。',
            }, {
                q: '除了旅館會送三餐之外，其他時間可以叫外送嗎？',
                a: '可以，只要在外送平台訂餐後付清費用，並在訂單上備註房號，一律送至旅館大廳櫃檯，櫃檯人員將會於三餐配送時間送至住客房門外。',
            }, {
                q: '家人可以送東西來嗎？',
                a: '可以，家人24小時皆可將需轉交的物品送至旅館大廳櫃台，櫃台人員將會於三餐配送時間送到住客房門外。',
            }, {
                q: '住宿期間有需求，如何聯絡服務人員呢？',
                a: '各旅館有24H客服中心，撥打房內電話即可找到人員替您協助。',
            }, {
                q: '要自己準備洗沐備品嗎？',
                a: '各旅館皆有準備15天份的洗髮沐浴備品，也歡迎帶自己適合的用品。',
            }, {
                q: '有網路可以使用嗎？',
                a: '旅館內皆會提供免費無線上網，不管是要辦公、玩遊戲、追偶像劇都沒問題。',
            }, {
                q: '家人想要住一起可以嗎？',
                a: '依政府規定隔離期間一間房間只能住一個人，唯有生活尚需共同照護之需求可同住，需共同照顧之定義：(1) 未成年(18歲)。(2) ≧65歲以上長者。(3) 身心障礙者。(4) 身心失能者。(5) 重大傷病者。(6) 孕婦懷孕第三孕期【第29週(含)以上】或其他經醫師評估懷孕期間需有人陪伴或照顧。(7) 因傷害或疾病，生活無法自理。',
            }, {
                q: '如何預定住宿呢？',
                a: '歡迎加入我們的 LINE@ 帳號，立即與客服人員聯繫。',
            }, {
                q: '訂房完成後會收到什麼資料嗎？',
                a: '訂房完成後將會收到預定確認單，下飛機後會有客服人員主動聯繫，抵達旅館將有專人協助完成入住手續。',
            },
        ],
        link: '/home#taicheng'
    }, {
        cityName: "高雄",
        note: '一分鐘讓您快速了解高雄防疫旅館的相關基本服務、安全措施、需求規定及辦法。',
        QaAs: [
            {
                q: '防疫旅館房間的消毒、環境衛生安全嗎？',
                a: '旅館於每次退房後會針對客房、走廊、大廳及電梯進行全面消毒作業，全程遵守政府規範的消毒及防護措施，超高規格的清潔作業程序、並注重每一個小細節，提供您最安全舒適的防疫住宿環境。',
            }, {
                q: '抵達防疫旅館的安全措施？',
                a: '各旅館皆有規劃專屬防疫動線，接待人員全程配戴口罩、自主管理量體溫，下車行經專屬安全通道直達旅館房間，安全不擔心！',
            }, {
                q: '防疫旅館三餐菜色內容是什麼 ?',
                a: '各旅館精心規劃每日不同菜色， 15天餐食不重複，各家餐廳也都極盡注重防疫及衛生，讓您15天吃得營養又健康。',
            }, {
                q: '如有素食及特殊需求怎麼辦 ?',
                a: '訂房時即會先行詢問是否有餐食上的特殊需求，素食、食物過敏或宗教因素等相關需求，皆可提前告知，並為您準備合適餐點。',
            }, {
                q: '外送需求是可以的嗎 ?',
                a: '可以訂購外送，但請於外送平台付清款項後，於外送單號上備註房號，讓外送人員配送至旅館一樓大廳。櫃台人員將於三餐配餐時間一同協助配送 !',
            }, {
                q: '家人送物資是可以的嗎 ?',
                a: '可以！請家人裝箱/袋後標示房號，送至旅館大廳櫃檯，櫃台人員將於三餐配餐時間一同協助配送 !',
            }, {
                q: '洗沐備品及飲用水需要自己準備嗎 ?',
                a: '各館皆有準備15天的洗髮及沐浴用品，飲用水也都會備齊於房內。',
            }, {
                q: '15天垃圾該如何處理 ?',
                a: '每日將由人員在指定時間做清理，請於各館規定時間將垃圾拿至房門外，請務必留意將垃圾綁緊打死結，以避免飛濺。',
            }, {
                q: '家人想要住一起可以嗎？',
                a: '依政府規定隔離期間一間房間只能住一個人，唯有生活尚需共同照護之需求可同住，需共同照顧之定義：(1) 未成年(18歲以下)。(2) ≧65歲以上長者。(3) 身心障礙者。(4) 身心失能者。(5) 重大傷病者。(6) 孕婦懷孕第三孕期【第29週(含)以上】或其他經醫師評估懷孕期間需有人陪伴或照顧。(7) 因傷害或疾病，生活無法自理。',
            }, {
                q: '防疫旅館內有提供WIFI嗎 ?',
                a: '提供免費無線上網吃到飽，讓您擁有良好的網路環境。',
            }, {
                q: '該如何預訂防疫旅館 ? 需要提供那些資料 ?',
                a: '請加入我們的官方LINE@帳號，將有客服人員協助回覆!建議備好您的班機資訊，以便客服人員為您查詢確切可入住房間，並提前為您保留房間喔!',
            }, {
                q: '防疫旅館補助該如何申請 ? 需提供什麼資料申請防疫旅館相關補助 ?',
                a: '政府提供之防疫補助完成檢疫後才可申請，退房後請至各館櫃檯辦理退房，將提供防疫旅館入住證明及發票，以便旅客申請政府補助。',
            },
        ],
        link: '/home#kaohsiung'
    }
])
</script>

<style scoped>
</style>